<a href="https://colab.research.google.com/github/Vasugi2003/Big-Data-Analytics/blob/main/JOIN_operation_SparkSession.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pyspark

from pyspark.sql import SparkSession

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.4.1)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [ ]:
spark = SparkSession.builder.appName("joins").getOrCreate()

In [ ]:
data = [["1","abi","ai"],
        ["2","banu","seirious"],
        ["3","harshi","tcl"],
        ["4","vino","giggs"]]

col = ["id","name","company"]

In [ ]:
data2 = [["2","banu","seirious"],
         ["5","guru","find"]]
col2 = ['id','name','company']

In [ ]:
df2 = spark.createDataFrame(data2,col2)
df2.show()

+---+----+--------+
| id|name| company|
+---+----+--------+
|  2|banu|seirious|
|  5|guru|    find|
+---+----+--------+

In [ ]:
df1 = spark.createDataFrame(data,col)
df1.show()

+---+------+--------+
| id|  name| company|
+---+------+--------+
|  1|   abi|      ai|
|  2|  banu|seirious|
|  3|harshi|     tcl|
|  4|  vino|   giggs|
+---+------+--------+

In [ ]:
df1.join(df2,df1.id == df2.id,"inner").show()

+---+----+--------+---+----+--------+
| id|name| company| id|name| company|
+---+----+--------+---+----+--------+
|  2|banu|seirious|  2|banu|seirious|
+---+----+--------+---+----+--------+

In [ ]:
df = df1.join(df2, on = ['id'], how="inner").show()

+---+----+--------+----+--------+
| id|name| company|name| company|
+---+----+--------+----+--------+
|  2|banu|seirious|banu|seirious|
+---+----+--------+----+--------+

In [ ]:
df1.createOrReplaceTempView('EMP')
df2.createOrReplaceTempView("stu")
df3 = spark\
      .sql("SELECT * FROM EMP INNER JOIN stu ON EMP.id == stu.id")\
      .show(truncate = False)

+---+----+--------+---+----+--------+
|id |name|company |id |name|company |
+---+----+--------+---+----+--------+
|2  |banu|seirious|2  |banu|seirious|
+---+----+--------+---+----+--------+

In [ ]:
df1.join(df2,df1.id == df2.id,"outer").show()

+----+------+--------+----+----+--------+
|  id|  name| company|  id|name| company|
+----+------+--------+----+----+--------+
|   1|   abi|      ai|null|null|    null|
|   2|  banu|seirious|   2|banu|seirious|
|   3|harshi|     tcl|null|null|    null|
|   4|  vino|   giggs|null|null|    null|
|null|  null|    null|   5|guru|    find|
+----+------+--------+----+----+--------+

In [ ]:
df = df1.join(df2, on = ['id'], how="OUTER").show()

+---+------+--------+----+--------+
| id|  name| company|name| company|
+---+------+--------+----+--------+
|  1|   abi|      ai|null|    null|
|  2|  banu|seirious|banu|seirious|
|  3|harshi|     tcl|null|    null|
|  4|  vino|   giggs|null|    null|
|  5|  null|    null|guru|    find|
+---+------+--------+----+--------+

In [ ]:
df1.createOrReplaceTempView('EMP')
df2.createOrReplaceTempView("stu")
df3 = spark\
      .sql("SELECT * FROM EMP FULL OUTER JOIN stu ON EMP.id == stu.id")\
      .show(truncate = False)

+----+------+--------+----+----+--------+
|id  |name  |company |id  |name|company |
+----+------+--------+----+----+--------+
|1   |abi   |ai      |null|null|null    |
|2   |banu  |seirious|2   |banu|seirious|
|3   |harshi|tcl     |null|null|null    |
|4   |vino  |giggs   |null|null|null    |
|null|null  |null    |5   |guru|find    |
+----+------+--------+----+----+--------+

In [ ]:
df1.join(df2,df1.id == df2.id,"left").show()

+---+------+--------+----+----+--------+
| id|  name| company|  id|name| company|
+---+------+--------+----+----+--------+
|  1|   abi|      ai|null|null|    null|
|  2|  banu|seirious|   2|banu|seirious|
|  3|harshi|     tcl|null|null|    null|
|  4|  vino|   giggs|null|null|    null|
+---+------+--------+----+----+--------+

In [ ]:
df = df1.join(df2, on = ['id'], how="left").show()

+---+------+--------+----+--------+
| id|  name| company|name| company|
+---+------+--------+----+--------+
|  1|   abi|      ai|null|    null|
|  2|  banu|seirious|banu|seirious|
|  3|harshi|     tcl|null|    null|
|  4|  vino|   giggs|null|    null|
+---+------+--------+----+--------+

In [ ]:
df1.createOrReplaceTempView('EMP')
df2.createOrReplaceTempView("stu")
df3 = spark\
      .sql("SELECT * FROM EMP LEFT JOIN stu ON EMP.id == stu.id")\
      .show(truncate = False)

+---+------+--------+----+----+--------+
|id |name  |company |id  |name|company |
+---+------+--------+----+----+--------+
|1  |abi   |ai      |null|null|null    |
|2  |banu  |seirious|2   |banu|seirious|
|3  |harshi|tcl     |null|null|null    |
|4  |vino  |giggs   |null|null|null    |
+---+------+--------+----+----+--------+

In [ ]:
df1.join(df2,df1.id == df2.id,"right").show()

+----+----+--------+---+----+--------+
|  id|name| company| id|name| company|
+----+----+--------+---+----+--------+
|   2|banu|seirious|  2|banu|seirious|
|null|null|    null|  5|guru|    find|
+----+----+--------+---+----+--------+

In [ ]:
df = df1.join(df2, on = ['id'], how="right").show()

+---+----+--------+----+--------+
| id|name| company|name| company|
+---+----+--------+----+--------+
|  2|banu|seirious|banu|seirious|
|  5|null|    null|guru|    find|
+---+----+--------+----+--------+

In [ ]:
df1.createOrReplaceTempView('EMP')
df2.createOrReplaceTempView("stu")
df3 = spark\
      .sql("SELECT * FROM EMP RIGHT JOIN stu ON EMP.id == stu.id")\
      .show(truncate = False)

+----+----+--------+---+----+--------+
|id  |name|company |id |name|company |
+----+----+--------+---+----+--------+
|2   |banu|seirious|2  |banu|seirious|
|null|null|null    |5  |guru|find    |
+----+----+--------+---+----+--------+